In [1]:
# https://pandas.pydata.org/pandas-docs/stable/reference/series.html
import pandas as pd
import numpy as np
from datetime import datetime, date

In [16]:
s = pd.Series(['apple', 'orange', 'kiwi', 'tool', 'kekek'], name='stuff')
# s.size # 5
s

0     apple
1    orange
2      kiwi
3      tool
4     kekek
Name: stuff, dtype: object

In [19]:
# s.name # 'stuff'
s.name = 'whatever'
s.name

'whatever'

In [20]:
pd.DataFrame(s)

  whatever
0    apple
1   orange
2     kiwi
3     tool
4    kekek

In [10]:
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.map.htmls
s1 = s.map({'apple': 1, 'orange': 666, 'kiwi': 3.14})
s1

0      1.00
1    666.00
2      3.14
3       NaN
4       NaN
dtype: float64

In [24]:
# s1.hasnans # True
s1.fillna('yo')

0       1
1     666
2    3.14
3      yo
4      yo
dtype: object

In [12]:
s1.replace([666, 'yo'], np.nan)

0    1.00
1     NaN
2    3.14
3     NaN
4     NaN
dtype: float64